# A, B = map(int, input().split())        # 띄어쓰기(스페이스바)를 기준으로 나눠서 변수에 정수로 저장


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 정수 n을 입력 받아, n부터 1까지 2씩 감소하면서 출력

# n = int(input())

# for i in range(n, 0, -2):
#     print(i, end=" ")


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 자연수 100에서 입력 받은 n의 값 만큼씩 뺀 값 중 0보다 크거나 같은 수를 출력

# n = int(input())

# for i in range(100 ,-1,-n ):
#     print(i, end=" ")


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# s = list(input().split())       # 띄어쓰기를 기준으로 나눠서 리스트로 저장


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 10개의 문자를 리스트에 저장(초기화)하고 차례대로 출력하는 프로그램을 작성해 보세요

# s = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I']

# for i in s:                     # for 반복의 range자리에 리스트를 넣어서 리스트의 길이만큼 반복
#                                 # 반복을 할때마다 리스트에 저장된 값을 하나씩 변수에 넣음 
#     print(i, end=' ')  


# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ #


# 26개의 문자 리스트를 선언하고 "A" 부터 "Z"까지 차례로 저장한 후, 거꾸로 출력하는 프로그램을 작성해보세요

ALPHABET = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']


print(ALPHABET[25], ALPHABET[24], ALPHABET[23], ALPHABET[22], ALPHABET[21], ALPHABET[20], ALPHABET[19], ALPHABET[18], ALPHABET[17], ALPHABET[16], ALPHABET[15], ALPHABET[14], ALPHABET[13], ALPHABET[12], ALPHABET[11], ALPHABET[10], ALPHABET[9], ALPHABET[8], ALPHABET[7], ALPHABET[6], ALPHABET[5], ALPHABET[4], ALPHABET[3], ALPHABET[2], ALPHABET[1], ALPHABET[0])